-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Мар 28 2023 г., 20:35
-- Версия сервера: 10.4.25-MariaDB
-- Версия PHP: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `hotel`
--

-- --------------------------------------------------------

--
-- Структура таблицы `карточки_регистрации`
--

CREATE TABLE `карточки_регистрации` (
  `номер_регистрации_клиента` int(3) NOT NULL,
  `номер_комнаты` int(3) NOT NULL,
  `дата_прибытия` date NOT NULL,
  `ФИО` varchar(50) NOT NULL,
  `предъявленный_документ` varchar(30) NOT NULL,
  `серия_и_номер_документа` int(30) NOT NULL,
  `дата_рождения` date NOT NULL,
  `пол` varchar(7) NOT NULL,
  `домашний_адрес` varchar(80) NOT NULL,
  `домашний_телефон` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `карточки_регистрации`
--

INSERT INTO `карточки_регистрации` (`номер_регистрации_клиента`, `номер_комнаты`, `дата_прибытия`, `ФИО`, `предъявленный_документ`, `серия_и_номер_документа`, `дата_рождения`, `пол`, `домашний_адрес`, `домашний_телефон`) VALUES
(1, 1, '2023-03-27', 'Иванов Иван Иванович', 'Паспорт', 68343283, '1983-10-13', 'Мужской', 'Проспект Ленина, 74 ', '+7 923 492-17-35'),
(2, 1, '2023-03-28', 'Петров Петр Петрович', 'Паспорт', 93568936, '1989-04-01', 'Мужской', 'Набережная, 20 ', '+7 999 334-21-11'),
(3, 1, '2023-03-26', 'Семенов Семен Семенович', 'Паспорт', 748459454, '2000-12-30', 'Мужской', 'Улица Калинина, 23 ', '+7 512 395-19-26');

-- --------------------------------------------------------

--
-- Структура таблицы `архив`
--

CREATE TABLE `архив` (
  `номер_регистрации_клиента` int(3) NOT NULL,
  `номер_комнаты` int(3) NOT NULL,
  `дата_прибытия` date NOT NULL,
  `дата_убытия` date NOT NULL,
  `ФИО` varchar(50) NOT NULL,
  `предъявленный_документ` varchar(30) NOT NULL,
  `серия_и_номер_документа` int(30) NOT NULL,
  `дата_рождения` date NOT NULL,
  `пол` varchar(7) NOT NULL,
  `домашний_адрес` varchar(80) NOT NULL,
  `домашний_телефон` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблицы `номера`
--

CREATE TABLE `номера` (
  `ID_номера` int(3) NOT NULL,
  `номер_комнаты` int(3) NOT NULL,
  `тип_номера` varchar(30) NOT NULL,
  `стоимость_номера` int(10) NOT NULL,
  `стоимость_на_одного_человека` int(10) DEFAULT NULL,
  `возможное_количество_проживающих` int(3) NOT NULL,
  `текущее_количество_проживающих` int(2) NOT NULL,
  `занят_свободен` varchar(8) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `номера`
--

INSERT INTO `номера` (`ID_номера`, `номер_комнаты`, `тип_номера`, `стоимость_номера`, `стоимость_на_одного_человека`, `возможное_количество_проживающих`, `текущее_количество_проживающих`, `занят_свободен`) VALUES
(1, 1, 'Стандартный номер', 2500, 2500, 4, 3, 'Свободен'),
(2, 2, 'Стандартный номер', 999, 999, 3, 0, 'Свободен'),
(3, 3, 'Стандартный номер', 1500, 1500, 2, 0, 'Свободен'),
(4, 4, 'Номер полулюкс', 8000, 0, 2, 0, 'Свободен'),
(5, 5, 'Номер люкс', 15000, 0, 1, 0, 'Свободен');

-- --------------------------------------------------------

--
-- Структура таблицы `расчетные_карточки`
--

CREATE TABLE `расчетные_карточки` (
  `номер_регистрации_клиента` int(3) NOT NULL,
  `оплата_брони` decimal(10,0) NOT NULL,
  `дата_убытия` date NOT NULL,
  `количество_оплаченных_дней` int(2) NOT NULL,
  `сумма_оплаты` decimal(10,0) NOT NULL,
  `окончательный_расчет` decimal(10,0) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `расчетные_карточки`
--

INSERT INTO `расчетные_карточки` (`номер_регистрации_клиента`, `оплата_брони`, `дата_убытия`, `количество_оплаченных_дней`, `сумма_оплаты`, `окончательный_расчет`) VALUES
(1, '500', '2023-03-31', 5, '12500', '13000'),
(2, '0', '2023-03-30', 3, '7500', '7500'),
(3, '500', '2023-04-01', 6, '15000', '15500');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `карточки_регистрации`
--
ALTER TABLE `карточки_регистрации`
  ADD PRIMARY KEY (`номер_регистрации_клиента`),
  ADD KEY `номер комнаты` (`номер_комнаты`);

--
-- Индексы таблицы `архив`
--
ALTER TABLE `архив`
  ADD PRIMARY KEY (`номер_регистрации_клиента`);

--
-- Индексы таблицы `номера`
--
ALTER TABLE `номера`
  ADD PRIMARY KEY (`ID_номера`),
  ADD UNIQUE KEY `номер_комнаты` (`номер_комнаты`);

--
-- Индексы таблицы `расчетные_карточки`
--
ALTER TABLE `расчетные_карточки`
  ADD PRIMARY KEY (`номер_регистрации_клиента`),
  ADD UNIQUE KEY `номер_регистрации_клиента` (`номер_регистрации_клиента`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `архив`
--
ALTER TABLE `архив`
  MODIFY `номер_регистрации_клиента` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT для таблицы `номера`
--
ALTER TABLE `номера`
  MODIFY `ID_номера` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `карточки_регистрации`
--
ALTER TABLE `карточки_регистрации`
  ADD CONSTRAINT `карточки_регистрации_ibfk_1` FOREIGN KEY (`номер_комнаты`) REFERENCES `номера` (`номер_комнаты`);

--
-- Ограничения внешнего ключа таблицы `расчетные_карточки`
--
ALTER TABLE `расчетные_карточки`
  ADD CONSTRAINT `расчетные_карточки_ibfk_1` FOREIGN KEY (`номер_регистрации_клиента`) REFERENCES `карточки_регистрации` (`номер_регистрации_клиента`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
